# Repositories
tap "fluxcd/tap"
tap "go-task/tap"
tap "homebrew/cask-fonts"
tap "jtyr/repo"
tap "koyeb/tap"
tap "openresty/brew"
tap "pulumi/tap"
tap "spacelift-io/spacelift"
tap "spectralops/tap"

# Packages
brew "age"
brew "atuin"
brew "azure-cli"
brew "asdf"
brew "azure/kubelogin/kubelogin"
brew "awscli"
brew "chezmoi"
brew "crossplane"
brew "colima"
brew "direnv"
brew "docker-buildx"
brew "docker-compose"
brew "gbt"
brew "geoip"
brew "ghq"
brew "git-lfs"
brew "go-task/tap/go-task"
brew "gpg"
brew "gmailctl"
brew "gnu-getopt"
brew "golang"
brew "helm"
brew "helmfile"
brew "fluxcd/tap/flux"
brew "fzf"
brew "jq"
brew "keyring"
brew "kind"
brew "koyeb/tap/koyeb"
brew "kwok"
brew "krew"
brew "kubecolor"
brew "kubectl"
brew "kubie"
brew "kustomize"
brew "k3d"
brew "k9s"
brew "libpq"
brew "openresty/brew/openresty"
brew "opentofu"
brew "osc"
brew "pulumi/tap/esc"
brew "pyenv"
brew "pyenv-virtualenv"
brew "sha2"
brew "skopeo"
brew "socket_vmnet"
brew "sops"
brew "spacelift-io/spacelift/spacectl"
brew "spectralops/tap/teller"
brew "stern"
brew "terraform"
brew "vault"
brew "watch"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# MacOS Applications
cask "1password-cli"
cask "arc"
cask "battery"
cask "coconutbattery"
cask "docker"
cask "font-meslo-for-powerline"
cask "gitbutler"
cask "gpg-suite"
cask "iterm2"
cask "obsidian"
cask "openvpn-connect"
cask "pycharm"
cask "rectangle"
cask "rubymine"
cask "sourcetree"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "webstorm"