# Repositories
tap "adoptopenjdk/openjdk"
tap "aquasecurity/trivy"
tap "civo/tools"
tap "go-task/tap"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "knqyf263/pet"
tap "xwmx/taps"
tap "goreleaser/tap"
tap "upbound/tap"

# Packages
brew "aquasecurity/trivy/trivy"
brew "ansible"
brew "argocd"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "civo"
brew "click"
brew "colordiff"
brew "ctop"
brew "direnv"
brew "dnscontrol"
brew "docker"
brew "eksctl"
brew "fzf"
brew "git-flow"
brew "goreleaser/tap/goreleaser"
brew "go-task/tap/go-task"
brew "gomplate"
brew "hcloud"
brew "helm"
brew "hugo"
brew "jq"
brew "kind"
brew "knqyf263/pet/pet"
brew "krew"
brew "kubectl"
brew "kustomize"
brew "k3d"
brew "k9s"
brew "minikube"
brew "nmap"
brew "packer"
brew "pulumi"
brew "pyenv"
brew "p7zip"
brew "scala@2.12"
brew "scw"
brew "sops"
brew "stern"
brew "teleport"
brew "terraform"
brew "tree"
brew "upbound/tap/up"
brew "wakeonlan"
brew "wget"
brew "xwmx/taps/hosts"
brew "yq"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# MacOS Applications
cask "adoptopenjdk11"
cask "discord"
cask "font-meslo-for-powerline"
cask "iterm2"
cask "gitkraken"
cask "gpg-suite"
cask "logmein-client"
cask "multipass"
cask "microsoft-teams"
cask "nitrokey"
cask "slack"
cask "toggl-track"
cask "teamviewer"
cask "vagrant"
cask "visual-studio-code"