# Repositories
tap "adoptopenjdk/openjdk"
tap "aquasecurity/trivy"
tap "civo/tools"
tap "dagger/tap"
tap "go-task/tap"
tap "fluxcd/tap"
tap "jtyr/repo"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "knqyf263/pet"
tap "pulumi/tap"
tap "xwmx/taps"
tap "goreleaser/tap"
tap "upbound/tap"
tap "hashicorp/tap"
tap "weaveworks/tap"

# Packages
brew "aquasecurity/trivy/trivy"
brew "ansible"
brew "argocd"
brew "atuin"
brew "awscli"
# brew "azure-cli"
brew "bat"
brew "bazelisk"
brew "civo"
brew "click"
brew "cloudflared"
brew "colordiff"
brew "ctop"
brew "direnv"
brew "dagger/tap/dagger"
brew "dnscontrol"
brew "eksctl"
brew "fluxcd/tap/flux@0.41"
brew "fzf"
brew "gbt"
brew "gdrive"
brew "gh"
brew "git"
brew "git-flow"
brew "glab"
brew "golang"
brew "goreleaser/tap/goreleaser"
brew "go-task/tap/go-task"
brew "gomplate"
brew "hcloud"
brew "helm"
brew "helmfile"
brew "hugo"
brew "jq"
brew "kind"
brew "kn"
brew "knqyf263/pet/pet"
brew "krew"
brew "kubie"
brew "kubectl"
brew "kubeseal"
brew "kustomize"
brew "k3d"
brew "k9s"
brew "nmap"
brew "packer"
brew "pulumi/tap/pulumi"
brew "pyenv"
brew "p7zip"
brew "lima"
brew "scala@2.12"
brew "scw"
brew "skaffold"
brew "sops"
brew "stern"
brew "teleport"
brew "terraform"
brew "terraform-docs"
brew "tfenv"
brew "tree"
brew "upbound/tap/up"
brew "wakeonlan"
brew "wget"
brew "weaveworks/tap/gitops"
brew "xwmx/taps/hosts"
brew "yq"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# MacOS Applications
cask "arc"
cask "android-file-transfer"
cask "discord"
cask "font-meslo-for-powerline"
cask "gpg-suite"
cask "nitrokey"
cask "obsidian"
cask "sourcetree"
cask "teamviewer"
cask "xbar"